import {Project, } from '../templates.js';
import {texts, } from '../../config/utils.js';
import {dataAllUrl} from '../../all-url/general.js';


export const apis = {
  name: 'API',
  key: 'apis',
  note: texts([
    'Оскільки в API немає **одного чіткого** посилання, так як посилання завжди **різні** в залежності від необхідності відповіді, посилань на API може бути **декілька**.',
  ]),
  data: [
    new Project({
      name: 'My Projects and About Me API',
      details: [
        '**Призначення**: Каталог моїх проєктів, інформація про мене.',
        '**Функціонал**: На різні запити повертає JSON з різними данними: коротка інформація про всі мої проєкти (ім\'я, тип, статус, посилання) детальна інформація про всі мої проєкти (опис, технічні дані, посилання), детальна інформація про мене (опис, FAQ, технічні навички).',
        '**Примітка**: Дане API не призначено для інших користувачів, оскільки надає суто дані, які потрібні **тільки автору** (мені; використовується в PortfolioHub та майже в усіх інших проєктах).',
        
      ],
      urlProject: (url) => dataAllUrl.all,
    }),
  ],
};
