import {Project, } from '../templates.js';
import {texts, } from '../../config/utils.js';


export const games = {
  name: 'Ігри',
  key: 'games',
  note: texts([
    'В деяких іграх в рендерингу скрізь (включаючи ігрові сцени) використовується **DOM** замість **Canvas**, деяким це може здатись нелогічно, але я хочу підкреслити **свідомість** вибору та **чітку ціль** вибору рендеринга для кожної гри (показати високий рівень маніпуляцій DOM елементами, тощо) та **розуміння** всіх плюсів і мінусів.',
  ]),
  data: [
    new Project({
      name: 'Dino-DOM', 
      details: [
        '**Механіки:** Схожі на Google Dino, але з оригінальними **асетами та іншими відміностями**. Можливо, в майбутньому буде значне розширення механік з додаванням **скінів, рівнів, та інших** можливостей.',
      ],
    }),
    
    new Project({
      name: 'Flappy UFO-DOM', 
      details: [
        '**Механіки:** Схожі на Flappy Bird, але замість птаха **НЛО (космічна тарілка)**. Можливо, в майбутньому буде значне розширення механік з додаванням **скінів, рівнів, та інших** можливостей.',
      ],
    }),
    
  ],
};
