import {Project, } from '../templates.js';
import {texts, } from '../../config/utils.js';


export const websites = {
  name: 'Сайти',
  key: 'websites',
  note: texts([
    'Інформація про мої контакти.',
    'Світла, темна та системна теми.',
  ]),
  data: [
    new Project({
      name: 'Calculator',
      details: [
        '**Призначення**: Простий калькулятор для базових арифметичних обчислень.',
        '**Функціонал**: Базові обчислення та операції.',
        
      ],
      techs: {
        architectures: ['SPA'],
      },
    }),
    new Project({
      name: 'Texture Altas Creator',
      details: [
        '**Призначення**: Генератор текстурних атласів.',
        '**Функціонал**: Генерація будь яких текстурних атласів з **одинаковими клітинами**, в ".png", ".webp", ".jpeg", та атласних конфігів в ".js" та ".json". Підтримує одночасну генерацію декількох елементів та форматів, є можливість завантажити ".zip" архів та ".txt" аналіз.',
        '**Примітка**: Інструмент для розробників.',
      ],
      techs: {
        architectures: ['SPA'],
        renderings: ['Canvas'],
        libs: ['JSZip'],
      },
    }),
    
    new Project({
      name: 'GameHub',
      status: 'alpha',
      details: [
        '**Призначення**: Каталог ігор.',
        '**Функціонал**: Перегляд ігор (більше 400), детальна інформація про кожну гру (включно з технічними данними та скріншотами), посилання на саму гру та завантаження гри, пошук, фільтр (загальне, жанри, теми, графіка, платформи, можна вибрати декілька параметрів одночасно).',
        
      ],
      techs: {
        architectures: ['SPA'],
        frameworks: ['Preact', 'Tailwind CSS', ],
        libs: ['Font Awesome', 'Navigo'],
        apis: ['CORS Proxy', 'FreeToGame', ],
      },
    }),
    
    new Project({
      name: 'PortfolioHub',
      details: [
        '**Призначення**: Каталог моїх проєктів, інформація про мене.',
        '**Функціонал**: Детальна інформація про всі мої проєкти (опис, технічні дані, посилання), детальна інформація про мене (опис, FAQ, технічні навички).',
        
      ],
      techs: {
        architectures: ['SPA'],
      },
    }),
    
    new Project({
      name: 'AniMe-DOM',
      details: [
        '**Призначення**: Перегляд аніме.',
        '**Функціонал**: Пошук, фільтр (роки, жанри, розклади, типи, вікові рейтинги, сезони, статуси, загальне), перегляд всіх або рандомних жанрів включно з їхнім зображенням, перегляд серій в різних якостях, інформація про аніме, схожі аніме за жанрами, франшизи, та акторів.',
        
      ],
      techs: {
        architectures: ['SPA'],
        libs: ['Hls.js', 'Plyr.js', 'Navigo'],
        apis: ['Static Libria', 'AniLiberty', 'AniLibria'],
      },
    }),
    
    new Project({
      name: 'AnimeHub-MPA', 
      status: 'alpha',
      details: [
        '**Призначення**: Каталог аніме.',
        '**Функціонал**: Пошук, фільтр (роки, жанри, студії, типи, можна вибрати **декілька фільтрів** одночасно), інформація про аніме, трейлери, персонажів, та акторів.',
        
      ],
      techs: {
        architectures: ['MPA'],
        frameworks: ['Preact'],
        libs: ['Font Awesome'],
        apis: ['Jikan'],
      },
    }),
    
    new Project({
      name: 'AnimeHub-SPA', 
      status: 'alpha',
      details: [
        '**Призначення**: Каталог аніме.',
        '**Функціонал**: Пошук, фільтр (роки, жанри, студії, типи, можна вибрати **декілька фільтрів** одночасно), інформація про аніме, трейлери, персонажів, та акторів.',
        
      ],
      techs: {
        architectures: ['SPA'],
        frameworks: ['React'],
        libs: ['Font Awesome', 'React Router'],
        apis: ['Jikan'],
      },
    }),
    
    new Project({
      name: 'AnimePotik-MPA', 
      details: [
        '**Призначення**: Каталог аніме.',
        '**Функціонал**: Пошук, фільтр (роки, жанри, студії, типи), інформація про аніме та трейлери.',
        
      ],
      techs: {
        architectures: ['MPA'],
        apis: ['Jikan'],
      },
    }),
    
    new Project({
      name: 'AnimePotik-SPA', 
      details: [
        '**Призначення**: Каталог аніме.',
        '**Функціонал**: Пошук, фільтр (роки, жанри, студії, типи), інформація про аніме та трейлери.',
        
      ],
      techs: {
        architectures: ['SPA'],
        apis: ['Jikan'],
      },
    }),
    
  ],
};
