import {Website, Game, API, APIUrl} from './templates.js';
import {texts} from '../config/utils.js';


export const dataProjectDetails = [
  {
    name: 'Сайти',
    note: texts([
      'Інформація про мої контакти.',
      'Світла, темна та системна теми.',
    ]),
    data: [
      new Website('AnimePotik-MPA', 
        [
          '**Призначення**: Каталог аніме.',
          '**Функціонал**: Пошук, фільтр (роки, жанри, студії, типи), інформація про аніме та трейлери.',
          
        ],
        {
          architectures: ['MPA'],
          apis: ['Jikan'],
        },
      ),
      
      new Website('AnimeHub-MPA', 
        [
          '**Призначення**: Каталог аніме.',
          '**Функціонал**: Пошук, фільтр (роки, жанри, студії, типи, можна вибрати **декілька фільтрів** одночасно), інформація про аніме, трейлери, персонажів, та акторів.',
          
        ],
        {
          architectures: ['MPA'],
          frameworks: ['Preact'],
          libs: ['Font Awesome'],
          apis: ['Jikan'],
          status: 'alpha',
        },
      ),
      
      new Website('AnimeHub-SPA', 
        [
          '**Призначення**: Каталог аніме.',
          '**Функціонал**: Пошук, фільтр (роки, жанри, студії, типи, можна вибрати **декілька фільтрів** одночасно), інформація про аніме, трейлери, персонажів, та акторів.',
          
        ],
        {
          architectures: ['SPA'],
          frameworks: ['React'],
          libs: ['Font Awesome', 'React Router'],
          apis: ['Jikan'],
          status: 'alpha',
        },
      ),
      
      new Website('AnimePotik-SPA', 
        [
          '**Призначення**: Каталог аніме.',
          '**Функціонал**: Пошук, фільтр (роки, жанри, студії, типи), інформація про аніме та трейлери.',
          
        ],
        {
          architectures: ['SPA'],
          apis: ['Jikan'],
        },
      ),
      
      new Website('AniMe-DOM',
        [
          '**Призначення**: Перегляд аніме.',
          '**Функціонал**: Пошук, фільтр (роки, жанри, розклади, типи, вікові рейтинги, сезони, статуси, загальне), перегляд всіх або рандомних жанрів включно з їхнім зображенням, перегляд серій в різних якостях, інформація про аніме, схожі аніме за жанрами, франшизи, та акторів.',
          
        ],
        {
          architectures: ['SPA'],
          libs: ['Hls.js', 'Plyr.js', 'Navigo'],
          apis: ['Static Libria', 'AniLiberty', 'AniLibria'],
        },
      ),
      
      new Website('GameHub',
        [
          '**Призначення**: Каталог ігор.',
          '**Функціонал**: Перегляд ігор (більше 400), детальна інформація про кожну гру (включно з технічними данними та скріншотами), посилання на саму гру та завантаження гри, пошук, фільтр (загальне, жанри, теми, графіка, платформи, можна вибрати декілька параметрів одночасно).',
          
        ],
        {
          architectures: ['SPA'],
          frameworks: ['Preact', 'Tailwind CSS', ],
          libs: ['Font Awesome', 'Navigo'],
          apis: ['CORS Proxy', 'FreeToGame', ],
          status: 'alpha',
        },
      ),
      
      new Website('PortfolioHub',
        [
          '**Призначення**: Каталог моїх проєктів, інформація про мене.',
          '**Функціонал**: Детальна інформація про всі мої проєкти (опис, технічні дані, посилання), детальна інформація про мене (опис, FAQ, технічні навички).',
          
        ],
        {
          architectures: ['SPA'],
        },
      ),
    ],
  },
  
  
  {
    name: 'Ігри',
    note: texts([
      'В деяких іграх в рендерингу скрізь (включаючи ігрові сцени) використовується **DOM** замість **canvas**, деяким це може здатись нелогічно, але я хочу підкреслити **свідомість** вибору та **чітку ціль** вибору рендеринга для кожної гри (показати високий рівень маніпуляцій DOM елементами, тощо) та **розуміння** всіх плюсів і мінусів.',
    ]),
    data: [
      new Game('Flappy UFO-DOM', 
        [
          '**Механіки:** Схожі на Flappy Bird, але замість птаха **НЛО (космічна тарілка)**. Можливо, в майбутньому буде значне розширення механік з додаванням **скінів, рівнів, та інших** можливостей.',
        ],
      ),
      
      new Game('Dino-DOM', 
        [
          '**Механіки:** Схожі на Google Dino, але з оригінальними **асетами та іншими відміностями**. Можливо, в майбутньому буде значне розширення механік з додаванням **скінів, рівнів, та інших** можливостей.',
        ],
      ),
    ],
  },
  
  
  {
    name: 'API',
    note: texts([
      'Оскільки в API немає **одного чіткого** посилання, так як посилання завжди **різні** в залежності від необхідності відповіді, посилань на API може бути **декілька**.',
    ]),
    data: [
      new API('My Projects And About Me API',
        [
          '**Призначення**: Каталог моїх проєктів, інформація про мене.',
          '**Функціонал**: На різні запити повертає JSON з різними данними: коротка інформація про всі мої проєкти (ім\'я, тип, статус, посилання) детальна інформація про всі мої проєкти (опис, технічні дані, посилання), детальна інформація про мене (опис, FAQ, технічні навички).',
          '**Примітка**: Дане API не призначено для інших користувачів, оскільки надає суто дані, які потрібні **тільки автору** (мені; використовується в PortfolioHub та майже в усіх інших проєктах).',
          
        ],
        {
          apiUrl: [
            new APIUrl('Проєкти', 'projects'),
            new APIUrl('Проєкти детальніше', 'projects-details'),
            new APIUrl('Про мене', 'about-me'),
          ],
        },
      ),
    ],
  },
];

