import {texts, } from '../config/utils.js';


const aboutMe = {
  name: 'Про мене',
  key: 'about-me',
  data: texts([
    '**Ім\'я та Роль:** Віктор — **Fullstack-розробник**, прагну працювати в компанії або на фрилансі.',
    '**Технічні умови:** Я працюю на **Android** (у зв\'язку з відсутністю ПК), тому мої проєкти ідеально оптимізовані для мобільних пристроїв. Це також дозволяє мені робити якісні сайти та ігри для Android-платформи.',
    '**Співпраця:** Працюю за **готовими макетами** (Figma, Sketch тощо) та чіткими ТЗ. Такий підхід гарантує 100% відповідність результату вашим очікуванням і значно прискорює реліз продукту.',
    
  ]),
};


const faq = {
  name: 'FAQ',
  key: 'faq',
  data: texts([
    '**Неповна інформація:** Якщо в проєкті не вказано певні деталі (рейтинг, рік тощо) — це означає, що дані відсутні в **сторонньому** API. Я свідомо не виводжу порожні поля, щоб зберігати інтерфейс чистим та естетичним.',
    '**Мова контенту:** Більшість API надають дані іноземними мовами. Рекомендую використовувати функцію **автоматичного перекладу** у вашому браузері для комфортного перегляду.',
    '**Дизайн:** Усі власні проєкти для портфоліо я розробляю самостійно, без наданого макету. Оскільки моєю основною спеціалізацією є **програмування**, а не графічний дизайн, візуальні рішення є **експериментальними** та можуть не відповідати професійним канонам.',
    
  ])
};


const techs = {
  name: 'Технології',
  key: 'techs',
  data: [
    {
      name: 'Архітектури',
      data: ['SPA', 'MPA', 'PWA']
    },
    {
      name: 'Рендеринг',
      data: ['DOM', 'Canvas', ]
    },
    {
      name: 'Хостинги',
      data: ['Статичний', 'Динамічний', ]
    },
    {
      name: 'Онлайн-платформи',
      data: ['GitHub', 'Cloudflare', 'jsDelivr', ]
    },
    {
      name: 'Мови програмування',
      data: ['JavaScript', ]
    }, 
    {
      name: 'Мови розмітки',
      data: ['HTML', 'Markdown', 'XML', ]
    }, 
    {
      name: 'Мови стилів',
      data: ['CSS', ]
    }, 
    {
      name: 'Формати даних',
      data: ['JSON', 'TOML', ]
    },
    {
      name: 'Формати векторної графіки',
      data: ['SVG', ]
    }, 
    {
      name: 'Фреймворки',
      data: ['React', 'Preact', 'Tailwind CSS', ]
    }, 
    {
      name: 'Бібліотеки',
      data: [
        'Navigo', 
        'React Router', 
        'Plyr.js', 
        'Hls.js', 
        'Font Awesome', 
        'JSZip',
      ]
    }, 
    {
      name: 'API',
      data: [
        'Jikan', 
        'Static Libria', 
        'AniLiberty', 
        'AniLibria', 
        'FreeToGame', 
        'CORS Proxy', 
        'My Projects and About Me API',
      ]
    },
  ],
};



export const aboutMeInfo = {
  'about-me': aboutMe,
  faq,
  techs,
  all: [
    aboutMe,
    faq,
    techs,
  ],
};