import {texts} from '../config/utils.js';


export const aboutMeInfo = {
  aboutMe: texts([
    '**Ім\'я та Роль:** Мене звуть Віктор. Я — **Frontend-розробник** (верстальник), який прагне працювати на фрилансі.',
    '**Навички:** Впевнено володію мовами HTML, CSS, Vanilla JavaScript, SVG та JavaScript-фреймворком React. Маю досвід роботи з API та великими масивами і об\'єктами локальних даних. Є досвід розробки багатьох **міні-ігор** та **сайтів** (не для портфоліо, для власного вдосконалення, можливо, в майбутньому я додам їх до портфоліо на **GitHub**). Досвіду роботи з бекендом не маю.',
    '**Портфоліо:** Це мій третій опублікований проєкт у портфоліо. Надалі планується додавання нових сайтів та ігор, а також доробка та публікація локальних проєктів.',
    '**Технічні умови:** Я працюю на **телефоні Android** (у зв\'язку з відсутністю ПК), тому мої проєкти ідеально оптимізовані для мобільних пристроїв. Це також дозволяє мені робити якісні сайти та ігри для Android-платформи.',
    '**Звернення до клієнтів (Важлива примітка):** Звертаюсь до майбутніх клієнтів із проханням надавати **готовий макет** (Figma, Sketch) та **чіткі технічні вимоги**. Це значно прискорить розробку, забезпечить 100% відповідність вашим очікуванням і дозволить уникнути тривалого узгодження дизайну.',
    '**Примітка розробника:** Як програміст, я надаю перевагу роботі за готовим макетом, оскільки це забезпечує швидкий результат, що відповідає очікуванням клієнта. Розробка власного ідеального дизайну є тривалим і складним процесом.',
    '**Мобільний пріоритет:** Оскільки проєкт розроблявся на телефоні (Android), його **вигляд на мобільних пристроях є ідеальним**. У зв\'язку з відсутністю ПК, я не можу гарантувати такого ж ідеального відображення на десктопних моніторах без додаткового тестування.',
    
  ]),
  
  FAQ: texts([
    '**Неповна інформація:** У деяких картках аніме може бути відсутня певна інформація (оцінка, віковий рейтинг, рік). Це не помилка коду, а **відсутність даних** безпосередньо в API Jikan для цих конкретних аніме. Я вирішив не виводити на екран написи на кшталт "Рік: невідомо", щоб не засмічувати інтерфейс.',
    '**Мова контенту:** На жаль, дані з Jikan доступні лише англійською та японською мовами. Однак, завдяки **автоматичному перекладу браузера**, який підтримується більшістю сучасних веб-оглядачів, ви зможете переглядати сайт своєю рідною мовою.',
    
  ]),
  
  myContacts: [],
  
  
  techLore: {
    architectures: ['SPA', 'MPA'],
    renderings: ['DOM'],
    hostings: ['Статичний', 'Динамічний'],
    onlinePlatforms: ['GitHub', 'Cloudflare'],
    langsProgrammings: ['JavaScript'], 
    langsMarkings: ['HTML', 'Markdown'], 
    langsStyles: ['CSS'], 
    langsDatas: ['JSON', 'TOML'],
    langsVectorGraphics: ['SVG'], 
    frameworks: ['React', 'Preact', 'Tailwind.css', ], 
    libs: ['Navigo', 'React Router', 'Plyr.js', 'Hls.js', 'Font Awesome'], 
    apis: [
      'Jikan', 'Static Libria', 'AniLiberty', 
      'AniLibria', 'FreeToGame', 'CORS Proxy', 
      'my-projects-list-data-api',
    ],
  }
  
};

