import {texts} from '../config/utils.js';


export const aboutMeInfo = [
  {
    name: 'Про мене',
    data: texts([
      '**Ім\'я та Роль:** Віктор — **Fullstack-розробник**, прагну працювати в компанії або на фрилансі.',
      '**Технічні умови:** Я працюю на **Android** (у зв\'язку з відсутністю ПК), тому мої проєкти ідеально оптимізовані для мобільних пристроїв. Це також дозволяє мені робити якісні сайти та ігри для Android-платформи.',
      '**Співпраця:** Працюю за **готовими макетами** (Figma, Sketch тощо) та чіткими ТЗ. Такий підхід гарантує 100% відповідність результату вашим очікуванням і значно прискорює реліз продукту.',
      
    ]),
  },
  
  
  {
    name: 'FAQ',
    data: texts([
      '**Неповна інформація:** Якщо в проєкті не вказано певні деталі (рейтинг, рік тощо) — це означає, що дані відсутні в **сторонньому** API. Я свідомо не виводжу порожні поля, щоб зберігати інтерфейс чистим та естетичним.',
      '**Мова контенту:** Більшість API надають дані іноземними мовами. Рекомендую використовувати функцію **автоматичного перекладу** у вашому браузері для комфортного перегляду.',
      '**Дизайн:** Усі власні проєкти для портфоліо я розробляю самостійно, без наданого макету. Оскільки моєю основною спеціалізацією є **програмування**, а не графічний дизайн, візуальні рішення є **експериментальними** та можуть не відповідати професійним канонам.',
      
    ])
  },
  
  
  {
    name: 'Технології',
    data: [
      {
        name: 'Архітектури',
        data: ['SPA', 'MPA']
      },
      {
        name: 'Рендеринг',
        data: ['DOM']
      },
      {
        name: 'Хостинги',
        data: ['Статичний', 'Динамічний']
      },
      {
        name: 'Онлайн-платформи',
        data: ['GitHub', 'Cloudflare']
      },
      {
        name: 'Мови програмування',
        data: ['JavaScript']
      }, 
      {
        name: 'Мови розмітки',
        data: ['HTML', 'Markdown']
      }, 
      {
        name: 'Мови стилів',
        data: ['CSS']
      }, 
      {
        name: 'Формати даних',
        data: ['JSON', 'TOML']
      },
      {
        name: 'Формати векторної графіки',
        data: ['SVG']
      }, 
      {
        name: 'Фреймворки',
        data: ['React', 'Preact', 'Tailwind CSS', ]
      }, 
      {
        name: 'Бібліотеки',
        data: ['Navigo', 'React Router', 'Plyr.js', 'Hls.js', 'Font Awesome']
      }, 
      {
        name: 'API',
        data: [
          'Jikan', 'Static Libria', 'AniLiberty', 
          'AniLibria', 'FreeToGame', 'CORS Proxy', 
          'My Projects And About Me API',
        ]
      },
    ],
  },
];

